package com.yzy.text;
/*推荐一本书
 * thinking in java
 * ————————————————————
 * 面向对象的基本原理：尽可能模拟人类习惯的思维方式，使开发软件的方法与人类的认识过程同步。
 * 1、对象   object 
 *      对象： 现实世界中实体在计算机逻辑中的映射和体现 ，对象同时还是类的具体实现
 * 2、 类：具有相同或相似属性或行为的对象的抽象，具有抽象化对象的模板
 * 3、 抽象：把主要事物拿出来，抛弃次要的事物    
 * 4、 属性：主要描述对象的静态状态、信息      （变量） 
 * 5、行为：对象的操作  各种动态信息        （方法）     ======变量和方法构成一个类
 *                         面向对象程序设计的特点
 *                1、封装： 将事物内部实现细节隐藏起来，对外部提供一致的公共接口，间接访问数据
 *                2、继承： 当一个类拥有另一个类的数据和操作，就这称这两个类具有继承关系（java中现在不支持多继承）
 *                3、多态： 方法的重载 、  重写（用在继承当中，子类重写父类的方法）
 *                4、抽象：只考虑研究对象主要的特点，不考虑次要的
 *                          类的定义
 *                1、类的声明
 *                2、类体 包含方法和变量
 * */
public class Text22OOP00 {
public static void main(String[] args) {
	System.out.println("javaSE基础");
}
}
